build/CrmFetchKit.bundle.min.js

// CrmFetchKit.js 3.0.0
// https://github.com/thuld/CrmFetchKit
// Daniel Thul <thuld@outlook.com> 
!function e(t,r,n){function a(o,s){if(!r[o]){if(!t[o]){var u="function"==typeof require&&require;if(!s&&u)return u(o,!0);if(i)return i(o,!0);var c=new Error("Cannot find module '"+o+"'");throw c.code="MODULE_NOT_FOUND",c}var l=r[o]={exports:{}};t[o][0].call(l.exports,function(e){var r=t[o][1][e];return a(r?r:e)},l,l.exports,e,t,r,n)}return r[o].exports}for(var i="function"==typeof require&&require,o=0;o<n.length;o++)a(n[o]);return a}({1:[function(e){var t=e("./util/soapXmlMessages"),r=e("./util/soapXmlParser");!function(e,n,a){"use strict";function i(){if(null===y)if("undefined"!=typeof GetGlobalContext)y=GetGlobalContext();else{if("undefined"==typeof Xrm)throw new Error("Context is not available.");y=Xrm.Page.context}return y}function o(){var t=e.location;if(null===b){var r=null,n=t+"//"+t,o=i();Xrm.Page.context.getClientUrl!==a?r=Xrm.Page.context.getClientUrl():o.isOutlookClient()&&!o.isOutlookOnline()?r=n:(r=o.getServerUrl(),r=r.replace(/^(http|https):\/\/([_a-zA-Z0-9\-\.]+)(:([0-9]{1,5}))?/,n),r=r.replace(/\/$/,"")),b=r}return b}function s(e,t){var n=t===!1?!1:!0,a=o()+v,i=new XMLHttpRequest,s=null,u=null;if(i.open("Post",a,n),i.setRequestHeader("Accept","application/xml, text/xml, */*"),i.setRequestHeader("Content-Type","text/xml; charset=utf-8"),i.setRequestHeader("SOAPAction","http://schemas.microsoft.com/xrm/2011/Contracts/Services/IOrganizationService/Execute"),n)u=new $.Deferred,s=u.promise(),i.onreadystatechange=function(){4===i.readyState&&(200===i.status?u.resolve(i.responseXML):u.reject(r.getSoapError(i.responseXML)))},i.send(e);else{if(i.send(e),200!==i.status){var c="CRM SERVER ERROR: "+r.getSoapError(i.responseXML);throw new Error(c)}s=i.responseXML}return s}function u(e,r,n,a){var i=t.getAssignXml(e,r,n,a);return s(i,!1)}function c(e,r,n,a){var i=t.getAssignXml(e,r,n,a);return s(i,!0)}function l(e){var n=t.getFetchMoreXml(e),a=s(n,!1);return r.getFetchResult(a)}function f(e){var n=t.getFetchMoreXml(e);return s(n,!0).then(function(e){return r.getFetchResult(e)})}function m(e,t){var n=$.Deferred(),a=[],i=t||1,o=null;return f(e,!0).then(function(t){a=a.concat(t.entities),t.moreRecords?(i++,o=r.setPagingDetails(e,i,t.pagingCookie),m(o,i).then(function(e){a=a.concat(e),n.resolve(a)},n.reject)):n.resolve(a)},n.reject),n.promise()}function p(e){var t=l(e);return t.entities}function d(e){return f(e).then(function(e){return e.entities})}function h(e,r,n){var a=t.buildGetByIdFetchXml(e,r,n),i=p(a);if(i.length>1)throw new Error('Expected 1 record, found "'+i.length+'"');return i[0]||null}function g(e,r,n){var a=t.buildGetByIdFetchXml(e,r,n);return d(a).then(function(e){if(e.length>1)throw new Error('Expected 1 record, found "'+e.length+'"');return e[0]||null})}var v="/XRMServices/2011/Organization.svc/web",y=null,b=null;e.CrmFetchKit={GetById:g,GetByIdSync:h,Fetch:d,FetchSync:p,FetchMore:f,FetchMoreSync:l,FetchAll:m,Assign:c,AssignSync:u}}(window,document)},{"./util/soapXmlMessages":4,"./util/soapXmlParser":5}],2:[function(e,t){{var r=t.exports=function n(e){return e.replace(/([&"<>'])/g,function(e,t){return n.map[t]})};r.map={">":"&gt;","<":"&lt;","'":"&apos;",'"':"&quot;","&":"&amp;"}}},{}],3:[function(e,t){t.exports=function(){"use strict";function e(){this.Id=null,this.logicalName=null,this.attributes={}}return e.prototype.getValue=function(e,t){var r=this.attributes[e];if(r){var n=r.type;switch(n){case"a:EntityReference":return void 0!==t?r[t]:r.guid;case"a:OptionSetValue":return void 0!==t?r[t]:r.value;default:return r.value}}return null},e}()},{}],4:[function(e,t){"use strict";function r(e){for(var t=[],r=0,n=e.length;n>r;r++)t.push('<attribute name="'+e[r]+'" />');return t.join("")}function n(e,t,n){var a=t+"id";return['<fetch version="1.0">','  <entity name="'+t+'">',r(n),'    <filter type="and">','      <condition attribute="'+a+'"','          operator="eq" value="'+e+'" />',"    </filter>","  </entity>","</fetch>"].join("")}function a(e){return['<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">'," <s:Body>",'  <Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services">','     <request i:type="b:RetrieveMultipleRequest" xmlns:b="http://schemas.microsoft.com/xrm/2011/Contracts" ','         xmlns:i="http://www.w3.org/2001/XMLSchema-instance">','             <b:Parameters xmlns:c="http://schemas.datacontract.org/2004/07/System.Collections.Generic">',"             <b:KeyValuePairOfstringanyType>","                 <c:key>Query</c:key>",'                 <c:value i:type="b:FetchExpression">',"                     <b:Query>",o(e),"                     </b:Query>","                 </c:value>","             </b:KeyValuePairOfstringanyType>","         </b:Parameters>",'         <b:RequestId i:nil="true"/>',"         <b:RequestName>RetrieveMultiple</b:RequestName>","     </request>"," </Execute>","</s:Body></s:Envelope>"].join("")}function i(e,t,r,n){return['<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">',"  <s:Body>",'    <Execute xmlns="http://schemas.microsoft.com/xrm/2011/Contracts/Services" ','           xmlns:i="http://www.w3.org/2001/XMLSchema-instance">','      <request i:type="b:AssignRequest" xmlns:a="http://schemas.microsoft.com/xrm/2011/Contracts" ','           xmlns:b="http://schemas.microsoft.com/crm/2011/Contracts">','        <a:Parameters xmlns:c="http://schemas.datacontract.org/2004/07/System.Collections.Generic">',"          <a:KeyValuePairOfstringanyType>","            <c:key>Target</c:key>",'            <c:value i:type="a:EntityReference">',"              <a:Id>"+e+"</a:Id>","              <a:LogicalName>"+t+"</a:LogicalName>",'              <a:Name i:nil="true" />',"            </c:value>","          </a:KeyValuePairOfstringanyType>","          <a:KeyValuePairOfstringanyType>","            <c:key>Assignee</c:key>",'            <c:value i:type="a:EntityReference">',"              <a:Id>"+r+"</a:Id>","              <a:LogicalName>"+n+"</a:LogicalName>",'              <a:Name i:nil="true" />',"            </c:value>","          </a:KeyValuePairOfstringanyType>","        </a:Parameters>",'        <a:RequestId i:nil="true" />',"        <a:RequestName>Assign</a:RequestName>","      </request>","    </Execute>","  </s:Body>","</s:Envelope>"].join("")}var o=e("xml-escape");t.exports={getFetchMoreXml:a,buildFetchAttributeXml:r,getAssignXml:i,buildGetByIdFetchXml:n}},{"xml-escape":2}],5:[function(e,t){var r=e("./BusinessEntity");t.exports=function(){"use strict";function e(e){return void 0!==e.text?e.text:e.textContent}function t(e,t){for(var r,n=0,a=e.childNodes.length;a>n;n++)if(r=e.childNodes[n],r.nodeName===t)return r}function n(e,t){for(var r=null,n=0;n<e.attributes.length;n++)if(r=e.attributes[n],r.name===t)return r.value}function a(r,n){return e(t(r,n))}function i(e,t,r){var n=new XMLSerializer,a=new DOMParser,i=a.parseFromString(e,"text/xml"),o=i.getElement("fetch");return o.setAttribute("page",t),o.setAttribute("paging-cookie",r),n.serializeToString(i)}function o(e){var t=e.split(/\D/);return new Date(Date.UTC(+t[0],--t[1],+t[2],+t[3],+t[4],+t[5],0))}function s(r){var n,a,i;try{return n=r.firstChild.firstChild,a=t(n,"s:Fault"),i=t(a,"faultstring"),e(i)}catch(o){return"An error occurred when parsing the error returned from CRM server: "+o.message}}function u(t){for(var r,n,a,i,o,s,u=0;u<t.childNodes.length;u++)switch(s=t.childNodes[u],s.nodeName){case"a:EntityName":r=e(s);break;case"a:MoreRecords":n="true"===e(s);break;case"a:PagingCookie":a=e(s);break;case"a:TotalRecordCount":i=parseInt(e(s),10);break;case"a:Entities":o=s}return{entityName:r,moreRecords:n,pagingCookie:a,totalRecordCount:i}}function c(e){for(var r,i,o,s,u={},c=0,l=e.childNodes.length;l>c;c++)r=e.childNodes[c],i=a(r,"b:key"),s=t(r,"b:value"),o=n(s,"i:type"),u[i]=m(o,s);return u}function l(e){var n,i,o,s,u=new r;u.Id=a(e,"a:Id"),u.attributes=c(t(e,"a:Attributes")),u.logicalName=a(e,"a:LogicalName"),n=t(e,"a:FormattedValues").childNodes;for(var l=0,f=n.length;f>l;l++)i=n[l],o=a(i,"b:key"),s=a(i,"b:value"),u.attributes[o].formattedValue=s;return u}function f(e){for(var r=t(e,"a:Entities").childNodes,n=u(e),a=[],i=0,o=r.length;o>i;i++)a.push(l(r[i]));return{entityName:n.entityName,moreRecords:n.moreRecords,pagingCookie:n.pagingCookie,totalRecordCount:n.totalRecordCount,entities:a}}function m(r,i){var s={type:r};switch(r){case"a:OptionSetValue":s.value=parseInt(e(i),10);break;case"a:EntityReference":s.guid=a(i,"a:Id"),s.name=a(i,"a:Name"),s.logicalName=a(i,"a:LogicalName");break;case"a:EntityCollection":s.value=f(i);break;case"a:Money":s.value=parseFloat(e(i),10);break;case"a:AliasedValue":var u=t(i,"a:Value"),c=n(u,"i:type");s=m(c,u);break;case"c:int":s.value=parseInt(e(i),10);break;case"c:decimal":s.value=parseFloat(e(i));break;case"c:dateTime":s.value=o(e(i));break;case"c:boolean":s.value="true"!==e(i)?!1:!0;break;default:s.value=e(i)}return s}function p(e){var r=e.firstChild.firstChild.firstChild.firstChild,n=t(r,"a:Results"),a=t(n.firstChild,"b:value");return f(a)}return{setPagingDetails:i,getSoapError:s,getFetchResult:p}}()},{"./BusinessEntity":3}]},{},[1]);